CREATE DATABASE  IF NOT EXISTS `gymcarry` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_bin */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `gymcarry`;
-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: mysql205.cszw5wiaeg6n.us-east-2.rds.amazonaws.com    Database: gymcarry
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '';

--
-- Table structure for table `boardcomment`
--

DROP TABLE IF EXISTS `boardcomment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `boardcomment` (
  `COMMENTIDX` int NOT NULL AUTO_INCREMENT COMMENT '댓글IDX',
  `POSTIDX` int NOT NULL COMMENT '게시글IDX',
  `COMMENTNICK` varchar(50) NOT NULL COMMENT '닉네임',
  `COMMENTCONTENT` text NOT NULL COMMENT '댓글내용',
  `COMMENTDATE` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '댓글작성일자',
  PRIMARY KEY (`COMMENTIDX`),
  KEY `FK_BOARD_TO_BOARDCOMMENT` (`POSTIDX`),
  CONSTRAINT `FK_BOARD_TO_BOARDCOMMENT` FOREIGN KEY (`POSTIDX`) REFERENCES `board` (`POSTIDX`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='게시판댓글';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `boardcomment`
--

LOCK TABLES `boardcomment` WRITE;
/*!40000 ALTER TABLE `boardcomment` DISABLE KEYS */;
INSERT INTO `boardcomment` VALUES (1,1,'평온하세요','안녕하세요..^^ 대흥역 가기전에.. 수저가라고 강추 드립니다^^* 홀쭉이배로 들어갔다가 뚱뚱이배로 나와요 ㅎㅎ 그만큼 양 듬뿍^^','2021-09-24 11:19:30'),(2,1,'별이','신촌역 부근에 또보겠지 떡볶이 존맛탱입니다!!! 또떡+버터갈릭 포테토+날치알치즈볶음밥 진리입니다','2021-09-24 11:25:16'),(3,2,'은경','저 다니는 헬스장 캐리님은 등허리힘이 아니라 뒷벅지 힘으로 상체를 들어라 허리에 무리가 안간다고 하셨어요','2021-09-24 11:54:21'),(4,1,'은경','신촌 소신이쏘 맛있다고 하던데...','2021-09-24 11:56:46'),(5,5,'별보다빛나리','^^ 넘 재밌네요 ㅎㅎ ','2021-09-24 11:58:23'),(6,4,'별보다빛나리','아이구 ..제가 10년저넹 끊어봤는데 젊을때 끊는게 좋아요^^.. 울 아들 딸 같아서 맘이 계쏙 쓰이네요 ㅎ ','2021-09-24 11:59:37'),(7,15,'스누피','3대 380이시라구요? 인증해주셔야할 것 같은데;; 저도 막 할 참여할순 없잔슴니가 ㅎ','2021-09-24 12:08:53'),(8,12,'스누피','저는 한라산급아니면 안갑니다','2021-09-24 12:09:34'),(9,15,'YerinBaek','저요!','2021-09-24 12:10:55'),(10,14,'YerinBaek','자바가 뭔가요?','2021-09-24 12:11:13'),(11,17,'BlueVinyl','엑박이요','2021-09-24 12:11:53'),(12,13,'BlueVinyl','바르닭 존맛입니다................허닭 요즘 세일안해서 킹받아욥','2021-09-24 12:12:12'),(13,17,'강아지좋아나도좋아','번호 주실 수 있나요 ?','2021-09-24 12:14:26'),(14,17,'지원지원','어라 이거 제사진인데........?','2021-09-24 12:16:33'),(15,15,'강아지좋아나도좋아','저.. 지금은 용기가안나서.. 일년뒤에도 혹시 하시나요..?','2021-09-24 12:16:47'),(16,18,'은경','저도 강아지는 아닌데 강아지 같이 놀 수 있어요! 같이 노실래요...?','2021-09-24 12:16:49'),(17,4,'난리부르스','술먹으시면 안되요 근솔실와요!!','2021-09-24 12:17:02'),(18,19,'난리부르스','사진이 안보여요!!ㅠ','2021-09-24 12:17:40'),(19,12,'난리부르스','백두산정돈되야죠','2021-09-24 12:20:57'),(20,18,'난리부르스','강아지 산책하고 한강에서 운동하세요!','2021-09-24 12:22:26'),(21,4,'김승민','담배 3갑이면 근손실 걱정할 게 아닌거 같은데..','2021-09-24 12:23:50'),(22,18,'김승민','멍멍!','2021-09-24 12:24:51'),(23,12,'김승민','허걱 스타빌로님.저도.같이.가고.싶네요','2021-09-24 12:25:54'),(24,20,'김승민','저도 그런 놈 만나서 헰스장에서 한바탕 했습니다 ','2021-09-24 12:29:29'),(25,21,'김승민','닭찌지 추천 좀','2021-09-24 12:29:47'),(26,16,'김승민','마음가짐은 무슨 그냥 하세요.','2021-09-24 12:30:37'),(27,12,'김승민','저도 갈래용!','2021-09-24 12:31:00'),(28,22,'승민쓰','꽃이.넘우.옙브네요...','2021-09-24 12:31:48'),(29,20,'승민쓰','나쁜새기.','2021-09-24 12:32:04'),(30,8,'승민쓰','태닝은 해야지 간지임','2021-09-24 12:32:44'),(31,6,'승민쓰','저 100m 11초인데 따라 올 수 있겠어요?','2021-09-24 12:33:08'),(32,5,'승민쓰','님 여친 없죠?ㅋㅋㅋ','2021-09-24 12:33:35'),(33,23,'승민쓰','ㅜㅜ우리 짱구 아프지마.. 너 아프면 나도 아프다..','2021-09-24 12:36:53'),(34,23,'춘식','짱구 아푸지마...','2021-09-24 12:37:27'),(35,25,'승민쓰','네 완전 정상입니다!','2021-09-24 12:39:57'),(36,17,'춘식','불펌은 안돼여 신고할거예여','2021-09-24 12:40:57'),(37,22,'승민최고','꽃을 보다 보니 마음이 평온해지네요..','2021-09-24 12:42:01'),(38,20,'승민최고','그 트레이너 누군가요? 제가 처리해드리겠습니다.','2021-09-24 12:42:34'),(39,13,'춘식','저는 아임닭 먹는데 맛이 다양해서 좋아요','2021-09-24 12:42:39'),(40,5,'승민최고','ㅋㅋㅋ우하하하! 넘 웃겨용','2021-09-24 12:43:01'),(41,3,'승민최고','제가 바로 멋진 젊은이입니다! 제가 가이드 해드리겠습니다! 따님과 함께 뵙고 싶습니다!','2021-09-24 12:44:12'),(42,27,'춘식','내일 무슨 스터디 하나요?','2021-09-24 12:47:37'),(43,27,'지원지원','...저요..가야겠죠..막내가 오라고 쥐잡듯 잡아서...','2021-09-24 12:49:46'),(44,26,'지원지원','내가봤을땐..우리안돼','2021-09-24 12:49:59'),(45,26,'예린','틀렸어...','2021-09-24 12:50:33'),(46,27,'BlueVinyl','...(정색)','2021-09-24 12:51:04'),(47,24,'BlueVinyl','ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2021-09-24 12:52:53'),(48,24,'BlueVinyl','삼겹살 승인 완.','2021-09-24 12:53:02'),(49,28,'승민최고','저 빨리 보러 가야되는데 언제 끝나죠..?','2021-09-24 12:53:28'),(50,29,'은경','안보이나요...','2021-09-24 13:08:59'),(51,29,'BlueVinyl','보이지 않숩니다..','2021-09-24 13:08:59'),(52,29,'은경','왜...보이지않는걸까요...다 옮겼는데....ㅠ','2021-09-24 13:09:38'),(53,29,'김승민','저는 보이는데 고양쓰~','2021-09-24 13:09:45'),(54,29,'BlueVinyl','새고 조져보겠숩니다','2021-09-24 13:10:00'),(55,29,'김승민','이거 전 메이븐 업데이트하고 서버 다시 켰어여!','2021-09-24 13:10:04'),(56,29,'은경','그럼..강아지도 보이나요...?','2021-09-24 13:10:34'),(57,29,'은경','ㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠ고양쓰 보인다니 눈물..','2021-09-24 13:10:49'),(58,28,'은경','저는 수료하면...정주행할거예요....','2021-09-24 13:11:23'),(59,29,'BlueVinyl','오ㅓ오 둘다 잘 보입니다리!!','2021-09-24 13:12:06'),(60,28,'BlueVinyl','우리..이제.....헤어지자.............................................환연봐야해~ㅠㅜㅜㅜㅜㅡㅡㅡ','2021-09-24 13:12:32'),(61,29,'은경','대박 감덩...ㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠ','2021-09-24 13:12:33'),(62,12,'은경','헐 스타빌로님 사진이 너무 멋있어요','2021-09-24 13:13:17'),(63,30,'BlueVinyl','진짜로 3000명이에요?????????????? ;;;;;;;;;;;;;;;','2021-09-24 13:24:30'),(64,31,'BlueVinyl','이미 쪗읍니다...무럭무럭..','2021-09-24 13:24:54'),(65,16,'춘식','하체는 그냥 조진다는 마음으로...','2021-09-24 13:25:19'),(66,30,'춘식','네,,,찐입니다,,,','2021-09-24 13:25:36'),(67,32,'춘식','와 얼굴쩐다','2021-09-25 02:33:37'),(68,32,'승민쓰','제 사진 도용하셨네요 신고합니다.','2021-09-25 03:08:35'),(69,32,'YerinBaek','??....승민님 역고소할게요','2021-09-25 04:33:17'),(70,34,'YerinBaek','청년핏쨔..','2021-09-25 04:33:40'),(71,34,'춘식','배고파요...','2021-09-25 04:34:52'),(72,32,'스누피','오빠 인스타 아이디 알려주세요','2021-09-25 04:36:22'),(73,33,'스누피','춘식아 !!! 너무 축하해여 !!! 파티하자 파티 파티~~~','2021-09-25 04:36:45'),(74,34,'스누피','밥 먹을때 노래 불러주세요~~','2021-09-25 04:37:14'),(75,32,'신셋찌','제가 대신 알려드림 인별 @seokj1012 입니다 ','2021-09-25 04:41:30'),(76,35,'평온하세요','거짓말은 몸에 좋지 않아요 ,,','2021-09-25 04:48:47'),(77,36,'YerinBaek','소주','2021-09-25 06:11:47'),(78,36,'신셋찌','피곤할땐 비타민 B랑 D가 좋대여!','2021-09-25 06:12:36'),(79,36,'신셋찌','피곤할땐 비타민 B랑 D가 좋대여!','2021-09-25 06:12:37'),(80,37,'신셋찌','홍원 추천합니다 배경이 예술이예여','2021-09-25 07:16:19'),(81,39,'ohyeah','캐쉬가 먹는건가여?!!','2021-09-26 12:57:08'),(82,40,'김승민','저도 민코 응원해요!','2021-09-26 13:08:45');
/*!40000 ALTER TABLE `boardcomment` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-09-26 22:48:33
